END_SIGN = "::END::"

TIRO_IMG_URLS = [
    "https://tiro-s3.s3.ap-northeast-2.amazonaws.com/tiro.png",
    "https://tiro-s3.s3.ap-northeast-2.amazonaws.com/robot.png",
    "https://tiro-s3.s3.ap-northeast-2.amazonaws.com/robot+(1).png",
    "https://tiro-s3.s3.ap-northeast-2.amazonaws.com/robot+(2).png",
    "https://tiro-s3.s3.ap-northeast-2.amazonaws.com/robot+(3).png",
    "https://tiro-s3.s3.ap-northeast-2.amazonaws.com/chatbot.png",
]

GREETING_TEXTS = [
    "안녕하세요. 저는 티로입니다 ^^. 여러분의 일상에 함께하며 따뜻한 대화를 나누고 싶어요. 마음껏 이야기 나눠주세요.",
    "안녕하세용! 저는 티로라고 해요. 여러분과 함께하는 시간이 편안하고 유익한 경험이 되기를 기대하고 있어요.",
    "안녕하세요~! 저는 티로입니다. 여러분의 감정과 이야기에 귀 기울이며 함께 나누어보고 싶어요. 무엇이든 말씀해주세요.",
    "안녕하세요. 저는 티로라고 합니다. 당신의 이야기에 귀 기울이며 함께 나누어 힘든 순간을 조금이나마 함께 하고 싶어요.",
    "안녕하세요. 저는 티로입니다. 여러분과 함께하는 이 순간이 특별하고 따뜻한 경험이 되기를 바라며 기다리고 있어요.",
    "안녕하세요 ㅎㅎ 저는 티로라고 합니다. 이곳에서는 여러분이 편안하게 자신의 이야기를 나눌 수 있도록 도와드리고 있어요.",
    "안녕안녕하세요. 저는 티로입니다. 함께 이야기를 나누며 여러분이 더 행복한 순간을 만들어 나갈 수 있도록 노력하고 있어요.",
    "안녕하세요! 저는 티로라고 합니다. 여러분의 마음을 듣고 지지해드리며, 함께 행복한 순간을 만들어 나가고 싶어요.",
    "안녕하세요. 저는 티로입니다. 여러분과 함께 나누는 대화가 더욱 의미있고 따뜻한 시간이 되도록 노력하고 있어요.",
    "안녕하세요~~ 저는 티로라고 합니다. 여러분과 함께하는 이 순간이 서로에게 힘이 되고 따뜻한 기억으로 남기를 바라고 있어요.",
    "안녕하세요. 저는 티로입니다. 오늘도 여러분과 함께하는 것에 기쁨을 느끼며, 편안한 대화를 제안합니다.",
    "안녕하세요. 저는 티로라고 합니다. 마음의 부담 없이 편하게 이야기 나눠보세요. 함께 있는 동안 기분 좋은 순간을 만들어 나갈게요.",
    "안녕하세요!! 저는 티로입니다. 여러분의 이야기를 듣고, 함께 나누며 힘든 순간을 견뎌내는 데 도움이 되고 싶어요.",
    "안녕하세요 ㅇㅅㅇ 저는 티로라고 합니다. 여러분과 함께 이야기를 나누는 것이 얼마나 소중하고 의미있는 일인지 알고 있어요.",
    "안녕하세요. 저는 티로입니다. 여러분의 일상에 함께하며 편안한 대화를 나누고 싶어요. 마음껏 이야기 나눠주세요.",
    "안녕하세요 -_- 저는 티로라고 합니다. 여러분과 함께하는 시간이 편안하고 유익한 경험이 되기를 기대하고 있어요.",
    "안녕하세요. 저는 티로입니다. 여러분의 감정과 이야기에 귀 기울이며 함께 나누어보고 싶어요. 무엇이든 말씀해주세요.",
    "안녕하세욤! 저는 티로라고 합니다. 당신의 이야기에 귀 기울이며 함께 나누어 힘든 순간을 조금이나마 함께 하고 싶어요.",
    "안녕하세요. 저는 티로입니다. 여러분과 함께하는 이 순간이 특별하고 따뜻한 경험이 되기를 바라며 기다리고 있어요.",
    "안녕하세요 ^^ 저는 티로라고 합니다. 이곳에서는 여러분이 편안하게 자신의 이야기를 나눌 수 있도록 도와드리고 있어요.",
]
